In [1]:
# What is missing data ?
# Values says (Na and NaN ,'') i.e missing data

In [1]:
# How to read excel file using pandas .
"gplay1.csv"

'gplay1.csv'

In [4]:
import pandas as pd

In [5]:
df=pd.read_csv("gplay1.csv")

In [6]:
len(df.columns)

10

In [13]:
df.isnull().sum()

Unnamed: 0        0
App               0
Category          1
Rating            0
Reviews           1
Size              1
Installs          1
Type              1
Price             1
Content Rating    1
dtype: int64

In [8]:
df['Rating'].isnull().sum()

322

In [13]:
# Cleaning and filling missing value

In [9]:
mean_data=df['Rating'].mean()

In [17]:
# Way 1  to update dataframe with result

#df['Rating']=df['Rating'].fillna(mean_data)

0       4.100000
1       3.900000
2       4.700000
3       4.500000
4       4.300000
          ...
5538    4.400000
5539    3.800000
5540    4.600000
5541    4.600000
5542    4.249761
Name: Rating, Length: 5543, dtype: float64

In [10]:
# Way 2  to update dataframe with result

df['Rating'].fillna(mean_data,inplace=True)

In [11]:
df['Rating']=df['Rating'].round(1)

In [12]:
df

,Unnamed: 0,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating
0,0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159.0,19M,"10,000+",Free,0,Everyone
1,1,Coloring book moana,ART_AND_DESIGN,3.9,967.0,14M,"500,000+",Free,0,Everyone
2,2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510.0,8.7M,"5,000,000+",Free,0,Everyone
3,3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644.0,25M,"50,000,000+",Free,0,Teen
4,4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967.0,2.8M,"100,000+",Free,0,Everyone
...,...,...,...,...,...,...,...,...,...,...
5538,5538,Flat Pack,GAME,4.4,862.0,44M,"100,000+",Free,0,Everyone 10+
5539,5539,Crayola Color Blaster,GAME,3.8,17.0,30M,"1,000+",Free,0,Everyone
5540,5540,Guns of Boom - Online Shooter,GAME,4.6,1226514.0,99M,"10,000,000+",Free,0,Teen
5541,5541,Guns Royale - Multiplayer Blocky Battle Royale,GAME,4.6,19070.0,90M,"100,000+",Free,0,Everyone 10+
5542,5542,B,NaN,4.2,NaN,NaN,NaN,NaN,NaN,NaN

# fillna

In [25]:
import numpy as np
df=pd.DataFrame([[np.nan,2,np.nan,0],[3,4,np.nan,1],[np.nan,np.nan,np.nan,np.nan],[np.nan,3,np.nan,4]],columns=['A',"B","C","D"])

In [26]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [16]:
df.fillna(0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [43]:
# Ffill

In [17]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [20]:
df.fillna(method='ffill')

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  3.0  4.0 NaN  1.0
3  3.0  3.0 NaN  4.0

In [46]:
# Key value fill

In [21]:
values={"A":0,"B":1,"C":2,"D":3}

In [22]:
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [27]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [28]:
values={"A":0,"B":1,"C":2,"D":3}
df.fillna(value=values,limit=2)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [50]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [52]:
# bfill

In [29]:
df.fillna(method='bfill')

     A    B   C    D
0  3.0  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  3.0 NaN  4.0
3  NaN  3.0 NaN  4.0

In [54]:
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0